espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32TG11B/Include/efm32tg11b_uart.h
/* Bit fields for UART TXDOUBLE */
#define _UART_TXDOUBLE_RESETVALUE              0x00000000UL                          /**< Default value for UART_TXDOUBLE */
#define _UART_TXDOUBLE_MASK                    0x0000FFFFUL                          /**< Mask for UART_TXDOUBLE */
#define _UART_TXDOUBLE_TXDATA0_SHIFT           0                                     /**< Shift value for USART_TXDATA0 */
#define _UART_TXDOUBLE_TXDATA0_MASK            0xFFUL                                /**< Bit mask for USART_TXDATA0 */
#define _UART_TXDOUBLE_TXDATA0_DEFAULT         0x00000000UL                          /**< Mode DEFAULT for UART_TXDOUBLE */
#define UART_TXDOUBLE_TXDATA0_DEFAULT          (_UART_TXDOUBLE_TXDATA0_DEFAULT << 0) /**< Shifted mode DEFAULT for UART_TXDOUBLE */
#define _UART_TXDOUBLE_TXDATA1_SHIFT           8                                     /**< Shift value for USART_TXDATA1 */
#define _UART_TXDOUBLE_TXDATA1_MASK            0xFF00UL                              /**< Bit mask for USART_TXDATA1 */
#define _UART_TXDOUBLE_TXDATA1_DEFAULT         0x00000000UL                          /**< Mode DEFAULT for UART_TXDOUBLE */
#define UART_TXDOUBLE_TXDATA1_DEFAULT          (_UART_TXDOUBLE_TXDATA1_DEFAULT << 8) /**< Shifted mode DEFAULT for UART_TXDOUBLE */

/* Bit fields for UART IF */
#define _UART_IF_RESETVALUE                    0x00000002UL                    /**< Default value for UART_IF */
#define _UART_IF_MASK                          0x0001FFFFUL                    /**< Mask for UART_IF */
#define UART_IF_TXC                            (0x1UL << 0)                    /**< TX Complete Interrupt Flag */
#define _UART_IF_TXC_SHIFT                     0                               /**< Shift value for USART_TXC */
#define _UART_IF_TXC_MASK                      0x1UL                           /**< Bit mask for USART_TXC */
#define _UART_IF_TXC_DEFAULT                   0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_TXC_DEFAULT                    (_UART_IF_TXC_DEFAULT << 0)     /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_TXBL                           (0x1UL << 1)                    /**< TX Buffer Level Interrupt Flag */
#define _UART_IF_TXBL_SHIFT                    1                               /**< Shift value for USART_TXBL */
#define _UART_IF_TXBL_MASK                     0x2UL                           /**< Bit mask for USART_TXBL */
#define _UART_IF_TXBL_DEFAULT                  0x00000001UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_TXBL_DEFAULT                   (_UART_IF_TXBL_DEFAULT << 1)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_RXDATAV                        (0x1UL << 2)                    /**< RX Data Valid Interrupt Flag */
#define _UART_IF_RXDATAV_SHIFT                 2                               /**< Shift value for USART_RXDATAV */
#define _UART_IF_RXDATAV_MASK                  0x4UL                           /**< Bit mask for USART_RXDATAV */
#define _UART_IF_RXDATAV_DEFAULT               0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_RXDATAV_DEFAULT                (_UART_IF_RXDATAV_DEFAULT << 2) /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_RXFULL                         (0x1UL << 3)                    /**< RX Buffer Full Interrupt Flag */
#define _UART_IF_RXFULL_SHIFT                  3                               /**< Shift value for USART_RXFULL */
#define _UART_IF_RXFULL_MASK                   0x8UL                           /**< Bit mask for USART_RXFULL */
#define _UART_IF_RXFULL_DEFAULT                0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_RXFULL_DEFAULT                 (_UART_IF_RXFULL_DEFAULT << 3)  /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_RXOF                           (0x1UL << 4)                    /**< RX Overflow Interrupt Flag */
#define _UART_IF_RXOF_SHIFT                    4                               /**< Shift value for USART_RXOF */
#define _UART_IF_RXOF_MASK                     0x10UL                          /**< Bit mask for USART_RXOF */
#define _UART_IF_RXOF_DEFAULT                  0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_RXOF_DEFAULT                   (_UART_IF_RXOF_DEFAULT << 4)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_RXUF                           (0x1UL << 5)                    /**< RX Underflow Interrupt Flag */
#define _UART_IF_RXUF_SHIFT                    5                               /**< Shift value for USART_RXUF */
#define _UART_IF_RXUF_MASK                     0x20UL                          /**< Bit mask for USART_RXUF */
#define _UART_IF_RXUF_DEFAULT                  0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_RXUF_DEFAULT                   (_UART_IF_RXUF_DEFAULT << 5)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_TXOF                           (0x1UL << 6)                    /**< TX Overflow Interrupt Flag */
#define _UART_IF_TXOF_SHIFT                    6                               /**< Shift value for USART_TXOF */
#define _UART_IF_TXOF_MASK                     0x40UL                          /**< Bit mask for USART_TXOF */
#define _UART_IF_TXOF_DEFAULT                  0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_TXOF_DEFAULT                   (_UART_IF_TXOF_DEFAULT << 6)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_TXUF                           (0x1UL << 7)                    /**< TX Underflow Interrupt Flag */
#define _UART_IF_TXUF_SHIFT                    7                               /**< Shift value for USART_TXUF */
#define _UART_IF_TXUF_MASK                     0x80UL                          /**< Bit mask for USART_TXUF */
#define _UART_IF_TXUF_DEFAULT                  0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_TXUF_DEFAULT                   (_UART_IF_TXUF_DEFAULT << 7)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_PERR                           (0x1UL << 8)                    /**< Parity Error Interrupt Flag */
#define _UART_IF_PERR_SHIFT                    8                               /**< Shift value for USART_PERR */
#define _UART_IF_PERR_MASK                     0x100UL                         /**< Bit mask for USART_PERR */
#define _UART_IF_PERR_DEFAULT                  0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_PERR_DEFAULT                   (_UART_IF_PERR_DEFAULT << 8)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_FERR                           (0x1UL << 9)                    /**< Framing Error Interrupt Flag */
#define _UART_IF_FERR_SHIFT                    9                               /**< Shift value for USART_FERR */
#define _UART_IF_FERR_MASK                     0x200UL                         /**< Bit mask for USART_FERR */
#define _UART_IF_FERR_DEFAULT                  0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_FERR_DEFAULT                   (_UART_IF_FERR_DEFAULT << 9)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_MPAF                           (0x1UL << 10)                   /**< Multi-Processor Address Frame Interrupt Flag */
#define _UART_IF_MPAF_SHIFT                    10                              /**< Shift value for USART_MPAF */
#define _UART_IF_MPAF_MASK                     0x400UL                         /**< Bit mask for USART_MPAF */
#define _UART_IF_MPAF_DEFAULT                  0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_MPAF_DEFAULT                   (_UART_IF_MPAF_DEFAULT << 10)   /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_SSM                            (0x1UL << 11)                   /**< Slave-Select in Master Mode Interrupt Flag */
#define _UART_IF_SSM_SHIFT                     11                              /**< Shift value for USART_SSM */
#define _UART_IF_SSM_MASK                      0x800UL                         /**< Bit mask for USART_SSM */
#define _UART_IF_SSM_DEFAULT                   0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_SSM_DEFAULT                    (_UART_IF_SSM_DEFAULT << 11)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_CCF                            (0x1UL << 12)                   /**< Collision Check Fail Interrupt Flag */
#define _UART_IF_CCF_SHIFT                     12                              /**< Shift value for USART_CCF */
#define _UART_IF_CCF_MASK                      0x1000UL                        /**< Bit mask for USART_CCF */
#define _UART_IF_CCF_DEFAULT                   0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_CCF_DEFAULT                    (_UART_IF_CCF_DEFAULT << 12)    /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_TXIDLE                         (0x1UL << 13)                   /**< TX Idle Interrupt Flag */
#define _UART_IF_TXIDLE_SHIFT                  13                              /**< Shift value for USART_TXIDLE */
#define _UART_IF_TXIDLE_MASK                   0x2000UL                        /**< Bit mask for USART_TXIDLE */
#define _UART_IF_TXIDLE_DEFAULT                0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_TXIDLE_DEFAULT                 (_UART_IF_TXIDLE_DEFAULT << 13) /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_TCMP0                          (0x1UL << 14)                   /**< Timer Comparator 0 Interrupt Flag */
#define _UART_IF_TCMP0_SHIFT                   14                              /**< Shift value for USART_TCMP0 */
#define _UART_IF_TCMP0_MASK                    0x4000UL                        /**< Bit mask for USART_TCMP0 */
#define _UART_IF_TCMP0_DEFAULT                 0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_TCMP0_DEFAULT                  (_UART_IF_TCMP0_DEFAULT << 14)  /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_TCMP1                          (0x1UL << 15)                   /**< Timer Comparator 1 Interrupt Flag */
#define _UART_IF_TCMP1_SHIFT                   15                              /**< Shift value for USART_TCMP1 */
#define _UART_IF_TCMP1_MASK                    0x8000UL                        /**< Bit mask for USART_TCMP1 */
#define _UART_IF_TCMP1_DEFAULT                 0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_TCMP1_DEFAULT                  (_UART_IF_TCMP1_DEFAULT << 15)  /**< Shifted mode DEFAULT for UART_IF */
#define UART_IF_TCMP2                          (0x1UL << 16)                   /**< Timer Comparator 2 Interrupt Flag */
#define _UART_IF_TCMP2_SHIFT                   16                              /**< Shift value for USART_TCMP2 */
#define _UART_IF_TCMP2_MASK                    0x10000UL                       /**< Bit mask for USART_TCMP2 */
#define _UART_IF_TCMP2_DEFAULT                 0x00000000UL                    /**< Mode DEFAULT for UART_IF */
#define UART_IF_TCMP2_DEFAULT                  (_UART_IF_TCMP2_DEFAULT << 16)  /**< Shifted mode DEFAULT for UART_IF */

/* Bit fields for UART IFS */
#define _UART_IFS_RESETVALUE                   0x00000000UL                     /**< Default value for UART_IFS */
#define _UART_IFS_MASK                         0x0001FFF9UL                     /**< Mask for UART_IFS */
#define UART_IFS_TXC                           (0x1UL << 0)                     /**< Set TXC Interrupt Flag */
#define _UART_IFS_TXC_SHIFT                    0                                /**< Shift value for USART_TXC */
#define _UART_IFS_TXC_MASK                     0x1UL                            /**< Bit mask for USART_TXC */
#define _UART_IFS_TXC_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_TXC_DEFAULT                   (_UART_IFS_TXC_DEFAULT << 0)     /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_RXFULL                        (0x1UL << 3)                     /**< Set RXFULL Interrupt Flag */
#define _UART_IFS_RXFULL_SHIFT                 3                                /**< Shift value for USART_RXFULL */
#define _UART_IFS_RXFULL_MASK                  0x8UL                            /**< Bit mask for USART_RXFULL */
#define _UART_IFS_RXFULL_DEFAULT               0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_RXFULL_DEFAULT                (_UART_IFS_RXFULL_DEFAULT << 3)  /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_RXOF                          (0x1UL << 4)                     /**< Set RXOF Interrupt Flag */
#define _UART_IFS_RXOF_SHIFT                   4                                /**< Shift value for USART_RXOF */
#define _UART_IFS_RXOF_MASK                    0x10UL                           /**< Bit mask for USART_RXOF */
#define _UART_IFS_RXOF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_RXOF_DEFAULT                  (_UART_IFS_RXOF_DEFAULT << 4)    /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_RXUF                          (0x1UL << 5)                     /**< Set RXUF Interrupt Flag */
#define _UART_IFS_RXUF_SHIFT                   5                                /**< Shift value for USART_RXUF */
#define _UART_IFS_RXUF_MASK                    0x20UL                           /**< Bit mask for USART_RXUF */
#define _UART_IFS_RXUF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_RXUF_DEFAULT                  (_UART_IFS_RXUF_DEFAULT << 5)    /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_TXOF                          (0x1UL << 6)                     /**< Set TXOF Interrupt Flag */
#define _UART_IFS_TXOF_SHIFT                   6                                /**< Shift value for USART_TXOF */
#define _UART_IFS_TXOF_MASK                    0x40UL                           /**< Bit mask for USART_TXOF */
#define _UART_IFS_TXOF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_TXOF_DEFAULT                  (_UART_IFS_TXOF_DEFAULT << 6)    /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_TXUF                          (0x1UL << 7)                     /**< Set TXUF Interrupt Flag */
#define _UART_IFS_TXUF_SHIFT                   7                                /**< Shift value for USART_TXUF */
#define _UART_IFS_TXUF_MASK                    0x80UL                           /**< Bit mask for USART_TXUF */
#define _UART_IFS_TXUF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_TXUF_DEFAULT                  (_UART_IFS_TXUF_DEFAULT << 7)    /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_PERR                          (0x1UL << 8)                     /**< Set PERR Interrupt Flag */
#define _UART_IFS_PERR_SHIFT                   8                                /**< Shift value for USART_PERR */
#define _UART_IFS_PERR_MASK                    0x100UL                          /**< Bit mask for USART_PERR */
#define _UART_IFS_PERR_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_PERR_DEFAULT                  (_UART_IFS_PERR_DEFAULT << 8)    /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_FERR                          (0x1UL << 9)                     /**< Set FERR Interrupt Flag */
#define _UART_IFS_FERR_SHIFT                   9                                /**< Shift value for USART_FERR */
#define _UART_IFS_FERR_MASK                    0x200UL                          /**< Bit mask for USART_FERR */
#define _UART_IFS_FERR_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_FERR_DEFAULT                  (_UART_IFS_FERR_DEFAULT << 9)    /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_MPAF                          (0x1UL << 10)                    /**< Set MPAF Interrupt Flag */
#define _UART_IFS_MPAF_SHIFT                   10                               /**< Shift value for USART_MPAF */
#define _UART_IFS_MPAF_MASK                    0x400UL                          /**< Bit mask for USART_MPAF */
#define _UART_IFS_MPAF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_MPAF_DEFAULT                  (_UART_IFS_MPAF_DEFAULT << 10)   /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_SSM                           (0x1UL << 11)                    /**< Set SSM Interrupt Flag */
#define _UART_IFS_SSM_SHIFT                    11                               /**< Shift value for USART_SSM */
#define _UART_IFS_SSM_MASK                     0x800UL                          /**< Bit mask for USART_SSM */
#define _UART_IFS_SSM_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_SSM_DEFAULT                   (_UART_IFS_SSM_DEFAULT << 11)    /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_CCF                           (0x1UL << 12)                    /**< Set CCF Interrupt Flag */
#define _UART_IFS_CCF_SHIFT                    12                               /**< Shift value for USART_CCF */
#define _UART_IFS_CCF_MASK                     0x1000UL                         /**< Bit mask for USART_CCF */
#define _UART_IFS_CCF_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_CCF_DEFAULT                   (_UART_IFS_CCF_DEFAULT << 12)    /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_TXIDLE                        (0x1UL << 13)                    /**< Set TXIDLE Interrupt Flag */
#define _UART_IFS_TXIDLE_SHIFT                 13                               /**< Shift value for USART_TXIDLE */
#define _UART_IFS_TXIDLE_MASK                  0x2000UL                         /**< Bit mask for USART_TXIDLE */
#define _UART_IFS_TXIDLE_DEFAULT               0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_TXIDLE_DEFAULT                (_UART_IFS_TXIDLE_DEFAULT << 13) /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_TCMP0                         (0x1UL << 14)                    /**< Set TCMP0 Interrupt Flag */
#define _UART_IFS_TCMP0_SHIFT                  14                               /**< Shift value for USART_TCMP0 */
#define _UART_IFS_TCMP0_MASK                   0x4000UL                         /**< Bit mask for USART_TCMP0 */
#define _UART_IFS_TCMP0_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_TCMP0_DEFAULT                 (_UART_IFS_TCMP0_DEFAULT << 14)  /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_TCMP1                         (0x1UL << 15)                    /**< Set TCMP1 Interrupt Flag */
#define _UART_IFS_TCMP1_SHIFT                  15                               /**< Shift value for USART_TCMP1 */
#define _UART_IFS_TCMP1_MASK                   0x8000UL                         /**< Bit mask for USART_TCMP1 */
#define _UART_IFS_TCMP1_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_TCMP1_DEFAULT                 (_UART_IFS_TCMP1_DEFAULT << 15)  /**< Shifted mode DEFAULT for UART_IFS */
#define UART_IFS_TCMP2                         (0x1UL << 16)                    /**< Set TCMP2 Interrupt Flag */
#define _UART_IFS_TCMP2_SHIFT                  16                               /**< Shift value for USART_TCMP2 */
#define _UART_IFS_TCMP2_MASK                   0x10000UL                        /**< Bit mask for USART_TCMP2 */
#define _UART_IFS_TCMP2_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IFS */
#define UART_IFS_TCMP2_DEFAULT                 (_UART_IFS_TCMP2_DEFAULT << 16)  /**< Shifted mode DEFAULT for UART_IFS */

