espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32TG11B/Include/efm32tg11b_uart.h
/* Bit fields for UART IEN */
#define _UART_IEN_RESETVALUE                   0x00000000UL                     /**< Default value for UART_IEN */
#define _UART_IEN_MASK                         0x0001FFFFUL                     /**< Mask for UART_IEN */
#define UART_IEN_TXC                           (0x1UL << 0)                     /**< TXC Interrupt Enable */
#define _UART_IEN_TXC_SHIFT                    0                                /**< Shift value for USART_TXC */
#define _UART_IEN_TXC_MASK                     0x1UL                            /**< Bit mask for USART_TXC */
#define _UART_IEN_TXC_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_TXC_DEFAULT                   (_UART_IEN_TXC_DEFAULT << 0)     /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_TXBL                          (0x1UL << 1)                     /**< TXBL Interrupt Enable */
#define _UART_IEN_TXBL_SHIFT                   1                                /**< Shift value for USART_TXBL */
#define _UART_IEN_TXBL_MASK                    0x2UL                            /**< Bit mask for USART_TXBL */
#define _UART_IEN_TXBL_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_TXBL_DEFAULT                  (_UART_IEN_TXBL_DEFAULT << 1)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_RXDATAV                       (0x1UL << 2)                     /**< RXDATAV Interrupt Enable */
#define _UART_IEN_RXDATAV_SHIFT                2                                /**< Shift value for USART_RXDATAV */
#define _UART_IEN_RXDATAV_MASK                 0x4UL                            /**< Bit mask for USART_RXDATAV */
#define _UART_IEN_RXDATAV_DEFAULT              0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_RXDATAV_DEFAULT               (_UART_IEN_RXDATAV_DEFAULT << 2) /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_RXFULL                        (0x1UL << 3)                     /**< RXFULL Interrupt Enable */
#define _UART_IEN_RXFULL_SHIFT                 3                                /**< Shift value for USART_RXFULL */
#define _UART_IEN_RXFULL_MASK                  0x8UL                            /**< Bit mask for USART_RXFULL */
#define _UART_IEN_RXFULL_DEFAULT               0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_RXFULL_DEFAULT                (_UART_IEN_RXFULL_DEFAULT << 3)  /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_RXOF                          (0x1UL << 4)                     /**< RXOF Interrupt Enable */
#define _UART_IEN_RXOF_SHIFT                   4                                /**< Shift value for USART_RXOF */
#define _UART_IEN_RXOF_MASK                    0x10UL                           /**< Bit mask for USART_RXOF */
#define _UART_IEN_RXOF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_RXOF_DEFAULT                  (_UART_IEN_RXOF_DEFAULT << 4)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_RXUF                          (0x1UL << 5)                     /**< RXUF Interrupt Enable */
#define _UART_IEN_RXUF_SHIFT                   5                                /**< Shift value for USART_RXUF */
#define _UART_IEN_RXUF_MASK                    0x20UL                           /**< Bit mask for USART_RXUF */
#define _UART_IEN_RXUF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_RXUF_DEFAULT                  (_UART_IEN_RXUF_DEFAULT << 5)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_TXOF                          (0x1UL << 6)                     /**< TXOF Interrupt Enable */
#define _UART_IEN_TXOF_SHIFT                   6                                /**< Shift value for USART_TXOF */
#define _UART_IEN_TXOF_MASK                    0x40UL                           /**< Bit mask for USART_TXOF */
#define _UART_IEN_TXOF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_TXOF_DEFAULT                  (_UART_IEN_TXOF_DEFAULT << 6)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_TXUF                          (0x1UL << 7)                     /**< TXUF Interrupt Enable */
#define _UART_IEN_TXUF_SHIFT                   7                                /**< Shift value for USART_TXUF */
#define _UART_IEN_TXUF_MASK                    0x80UL                           /**< Bit mask for USART_TXUF */
#define _UART_IEN_TXUF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_TXUF_DEFAULT                  (_UART_IEN_TXUF_DEFAULT << 7)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_PERR                          (0x1UL << 8)                     /**< PERR Interrupt Enable */
#define _UART_IEN_PERR_SHIFT                   8                                /**< Shift value for USART_PERR */
#define _UART_IEN_PERR_MASK                    0x100UL                          /**< Bit mask for USART_PERR */
#define _UART_IEN_PERR_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_PERR_DEFAULT                  (_UART_IEN_PERR_DEFAULT << 8)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_FERR                          (0x1UL << 9)                     /**< FERR Interrupt Enable */
#define _UART_IEN_FERR_SHIFT                   9                                /**< Shift value for USART_FERR */
#define _UART_IEN_FERR_MASK                    0x200UL                          /**< Bit mask for USART_FERR */
#define _UART_IEN_FERR_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_FERR_DEFAULT                  (_UART_IEN_FERR_DEFAULT << 9)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_MPAF                          (0x1UL << 10)                    /**< MPAF Interrupt Enable */
#define _UART_IEN_MPAF_SHIFT                   10                               /**< Shift value for USART_MPAF */
#define _UART_IEN_MPAF_MASK                    0x400UL                          /**< Bit mask for USART_MPAF */
#define _UART_IEN_MPAF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_MPAF_DEFAULT                  (_UART_IEN_MPAF_DEFAULT << 10)   /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_SSM                           (0x1UL << 11)                    /**< SSM Interrupt Enable */
#define _UART_IEN_SSM_SHIFT                    11                               /**< Shift value for USART_SSM */
#define _UART_IEN_SSM_MASK                     0x800UL                          /**< Bit mask for USART_SSM */
#define _UART_IEN_SSM_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_SSM_DEFAULT                   (_UART_IEN_SSM_DEFAULT << 11)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_CCF                           (0x1UL << 12)                    /**< CCF Interrupt Enable */
#define _UART_IEN_CCF_SHIFT                    12                               /**< Shift value for USART_CCF */
#define _UART_IEN_CCF_MASK                     0x1000UL                         /**< Bit mask for USART_CCF */
#define _UART_IEN_CCF_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_CCF_DEFAULT                   (_UART_IEN_CCF_DEFAULT << 12)    /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_TXIDLE                        (0x1UL << 13)                    /**< TXIDLE Interrupt Enable */
#define _UART_IEN_TXIDLE_SHIFT                 13                               /**< Shift value for USART_TXIDLE */
#define _UART_IEN_TXIDLE_MASK                  0x2000UL                         /**< Bit mask for USART_TXIDLE */
#define _UART_IEN_TXIDLE_DEFAULT               0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_TXIDLE_DEFAULT                (_UART_IEN_TXIDLE_DEFAULT << 13) /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_TCMP0                         (0x1UL << 14)                    /**< TCMP0 Interrupt Enable */
#define _UART_IEN_TCMP0_SHIFT                  14                               /**< Shift value for USART_TCMP0 */
#define _UART_IEN_TCMP0_MASK                   0x4000UL                         /**< Bit mask for USART_TCMP0 */
#define _UART_IEN_TCMP0_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_TCMP0_DEFAULT                 (_UART_IEN_TCMP0_DEFAULT << 14)  /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_TCMP1                         (0x1UL << 15)                    /**< TCMP1 Interrupt Enable */
#define _UART_IEN_TCMP1_SHIFT                  15                               /**< Shift value for USART_TCMP1 */
#define _UART_IEN_TCMP1_MASK                   0x8000UL                         /**< Bit mask for USART_TCMP1 */
#define _UART_IEN_TCMP1_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_TCMP1_DEFAULT                 (_UART_IEN_TCMP1_DEFAULT << 15)  /**< Shifted mode DEFAULT for UART_IEN */
#define UART_IEN_TCMP2                         (0x1UL << 16)                    /**< TCMP2 Interrupt Enable */
#define _UART_IEN_TCMP2_SHIFT                  16                               /**< Shift value for USART_TCMP2 */
#define _UART_IEN_TCMP2_MASK                   0x10000UL                        /**< Bit mask for USART_TCMP2 */
#define _UART_IEN_TCMP2_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IEN */
#define UART_IEN_TCMP2_DEFAULT                 (_UART_IEN_TCMP2_DEFAULT << 16)  /**< Shifted mode DEFAULT for UART_IEN */

/* Bit fields for UART IRCTRL */
#define _UART_IRCTRL_RESETVALUE                0x00000000UL                         /**< Default value for UART_IRCTRL */
#define _UART_IRCTRL_MASK                      0x0000078FUL                         /**< Mask for UART_IRCTRL */
#define UART_IRCTRL_IREN                       (0x1UL << 0)                         /**< Enable IrDA Module */
#define _UART_IRCTRL_IREN_SHIFT                0                                    /**< Shift value for USART_IREN */
#define _UART_IRCTRL_IREN_MASK                 0x1UL                                /**< Bit mask for USART_IREN */
#define _UART_IRCTRL_IREN_DEFAULT              0x00000000UL                         /**< Mode DEFAULT for UART_IRCTRL */
#define UART_IRCTRL_IREN_DEFAULT               (_UART_IRCTRL_IREN_DEFAULT << 0)     /**< Shifted mode DEFAULT for UART_IRCTRL */
#define _UART_IRCTRL_IRPW_SHIFT                1                                    /**< Shift value for USART_IRPW */
#define _UART_IRCTRL_IRPW_MASK                 0x6UL                                /**< Bit mask for USART_IRPW */
#define _UART_IRCTRL_IRPW_DEFAULT              0x00000000UL                         /**< Mode DEFAULT for UART_IRCTRL */
#define _UART_IRCTRL_IRPW_ONE                  0x00000000UL                         /**< Mode ONE for UART_IRCTRL */
#define _UART_IRCTRL_IRPW_TWO                  0x00000001UL                         /**< Mode TWO for UART_IRCTRL */
#define _UART_IRCTRL_IRPW_THREE                0x00000002UL                         /**< Mode THREE for UART_IRCTRL */
#define _UART_IRCTRL_IRPW_FOUR                 0x00000003UL                         /**< Mode FOUR for UART_IRCTRL */
#define UART_IRCTRL_IRPW_DEFAULT               (_UART_IRCTRL_IRPW_DEFAULT << 1)     /**< Shifted mode DEFAULT for UART_IRCTRL */
#define UART_IRCTRL_IRPW_ONE                   (_UART_IRCTRL_IRPW_ONE << 1)         /**< Shifted mode ONE for UART_IRCTRL */
#define UART_IRCTRL_IRPW_TWO                   (_UART_IRCTRL_IRPW_TWO << 1)         /**< Shifted mode TWO for UART_IRCTRL */
#define UART_IRCTRL_IRPW_THREE                 (_UART_IRCTRL_IRPW_THREE << 1)       /**< Shifted mode THREE for UART_IRCTRL */
#define UART_IRCTRL_IRPW_FOUR                  (_UART_IRCTRL_IRPW_FOUR << 1)        /**< Shifted mode FOUR for UART_IRCTRL */
#define UART_IRCTRL_IRFILT                     (0x1UL << 3)                         /**< IrDA RX Filter */
#define _UART_IRCTRL_IRFILT_SHIFT              3                                    /**< Shift value for USART_IRFILT */
#define _UART_IRCTRL_IRFILT_MASK               0x8UL                                /**< Bit mask for USART_IRFILT */
#define _UART_IRCTRL_IRFILT_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for UART_IRCTRL */
#define UART_IRCTRL_IRFILT_DEFAULT             (_UART_IRCTRL_IRFILT_DEFAULT << 3)   /**< Shifted mode DEFAULT for UART_IRCTRL */
#define UART_IRCTRL_IRPRSEN                    (0x1UL << 7)                         /**< IrDA PRS Channel Enable */
#define _UART_IRCTRL_IRPRSEN_SHIFT             7                                    /**< Shift value for USART_IRPRSEN */
#define _UART_IRCTRL_IRPRSEN_MASK              0x80UL                               /**< Bit mask for USART_IRPRSEN */
#define _UART_IRCTRL_IRPRSEN_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for UART_IRCTRL */
#define UART_IRCTRL_IRPRSEN_DEFAULT            (_UART_IRCTRL_IRPRSEN_DEFAULT << 7)  /**< Shifted mode DEFAULT for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_SHIFT            8                                    /**< Shift value for USART_IRPRSSEL */
#define _UART_IRCTRL_IRPRSSEL_MASK             0x700UL                              /**< Bit mask for USART_IRPRSSEL */
#define _UART_IRCTRL_IRPRSSEL_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_PRSCH0           0x00000000UL                         /**< Mode PRSCH0 for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_PRSCH1           0x00000001UL                         /**< Mode PRSCH1 for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_PRSCH2           0x00000002UL                         /**< Mode PRSCH2 for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_PRSCH3           0x00000003UL                         /**< Mode PRSCH3 for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_PRSCH4           0x00000004UL                         /**< Mode PRSCH4 for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_PRSCH5           0x00000005UL                         /**< Mode PRSCH5 for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_PRSCH6           0x00000006UL                         /**< Mode PRSCH6 for UART_IRCTRL */
#define _UART_IRCTRL_IRPRSSEL_PRSCH7           0x00000007UL                         /**< Mode PRSCH7 for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_DEFAULT           (_UART_IRCTRL_IRPRSSEL_DEFAULT << 8) /**< Shifted mode DEFAULT for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_PRSCH0            (_UART_IRCTRL_IRPRSSEL_PRSCH0 << 8)  /**< Shifted mode PRSCH0 for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_PRSCH1            (_UART_IRCTRL_IRPRSSEL_PRSCH1 << 8)  /**< Shifted mode PRSCH1 for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_PRSCH2            (_UART_IRCTRL_IRPRSSEL_PRSCH2 << 8)  /**< Shifted mode PRSCH2 for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_PRSCH3            (_UART_IRCTRL_IRPRSSEL_PRSCH3 << 8)  /**< Shifted mode PRSCH3 for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_PRSCH4            (_UART_IRCTRL_IRPRSSEL_PRSCH4 << 8)  /**< Shifted mode PRSCH4 for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_PRSCH5            (_UART_IRCTRL_IRPRSSEL_PRSCH5 << 8)  /**< Shifted mode PRSCH5 for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_PRSCH6            (_UART_IRCTRL_IRPRSSEL_PRSCH6 << 8)  /**< Shifted mode PRSCH6 for UART_IRCTRL */
#define UART_IRCTRL_IRPRSSEL_PRSCH7            (_UART_IRCTRL_IRPRSSEL_PRSCH7 << 8)  /**< Shifted mode PRSCH7 for UART_IRCTRL */

/* Bit fields for UART INPUT */
#define _UART_INPUT_RESETVALUE                 0x00000000UL                         /**< Default value for UART_INPUT */
#define _UART_INPUT_MASK                       0x00008787UL                         /**< Mask for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_SHIFT             0                                    /**< Shift value for USART_RXPRSSEL */
#define _UART_INPUT_RXPRSSEL_MASK              0x7UL                                /**< Bit mask for USART_RXPRSSEL */
#define _UART_INPUT_RXPRSSEL_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH0            0x00000000UL                         /**< Mode PRSCH0 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH1            0x00000001UL                         /**< Mode PRSCH1 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH2            0x00000002UL                         /**< Mode PRSCH2 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH3            0x00000003UL                         /**< Mode PRSCH3 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH4            0x00000004UL                         /**< Mode PRSCH4 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH5            0x00000005UL                         /**< Mode PRSCH5 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH6            0x00000006UL                         /**< Mode PRSCH6 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH7            0x00000007UL                         /**< Mode PRSCH7 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_DEFAULT            (_UART_INPUT_RXPRSSEL_DEFAULT << 0)  /**< Shifted mode DEFAULT for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH0             (_UART_INPUT_RXPRSSEL_PRSCH0 << 0)   /**< Shifted mode PRSCH0 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH1             (_UART_INPUT_RXPRSSEL_PRSCH1 << 0)   /**< Shifted mode PRSCH1 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH2             (_UART_INPUT_RXPRSSEL_PRSCH2 << 0)   /**< Shifted mode PRSCH2 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH3             (_UART_INPUT_RXPRSSEL_PRSCH3 << 0)   /**< Shifted mode PRSCH3 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH4             (_UART_INPUT_RXPRSSEL_PRSCH4 << 0)   /**< Shifted mode PRSCH4 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH5             (_UART_INPUT_RXPRSSEL_PRSCH5 << 0)   /**< Shifted mode PRSCH5 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH6             (_UART_INPUT_RXPRSSEL_PRSCH6 << 0)   /**< Shifted mode PRSCH6 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH7             (_UART_INPUT_RXPRSSEL_PRSCH7 << 0)   /**< Shifted mode PRSCH7 for UART_INPUT */
#define UART_INPUT_RXPRS                       (0x1UL << 7)                         /**< PRS RX Enable */
#define _UART_INPUT_RXPRS_SHIFT                7                                    /**< Shift value for USART_RXPRS */
#define _UART_INPUT_RXPRS_MASK                 0x80UL                               /**< Bit mask for USART_RXPRS */
#define _UART_INPUT_RXPRS_DEFAULT              0x00000000UL                         /**< Mode DEFAULT for UART_INPUT */
#define UART_INPUT_RXPRS_DEFAULT               (_UART_INPUT_RXPRS_DEFAULT << 7)     /**< Shifted mode DEFAULT for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_SHIFT            8                                    /**< Shift value for USART_CLKPRSSEL */
#define _UART_INPUT_CLKPRSSEL_MASK             0x700UL                              /**< Bit mask for USART_CLKPRSSEL */
#define _UART_INPUT_CLKPRSSEL_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH0           0x00000000UL                         /**< Mode PRSCH0 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH1           0x00000001UL                         /**< Mode PRSCH1 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH2           0x00000002UL                         /**< Mode PRSCH2 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH3           0x00000003UL                         /**< Mode PRSCH3 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH4           0x00000004UL                         /**< Mode PRSCH4 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH5           0x00000005UL                         /**< Mode PRSCH5 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH6           0x00000006UL                         /**< Mode PRSCH6 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH7           0x00000007UL                         /**< Mode PRSCH7 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_DEFAULT           (_UART_INPUT_CLKPRSSEL_DEFAULT << 8) /**< Shifted mode DEFAULT for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH0            (_UART_INPUT_CLKPRSSEL_PRSCH0 << 8)  /**< Shifted mode PRSCH0 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH1            (_UART_INPUT_CLKPRSSEL_PRSCH1 << 8)  /**< Shifted mode PRSCH1 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH2            (_UART_INPUT_CLKPRSSEL_PRSCH2 << 8)  /**< Shifted mode PRSCH2 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH3            (_UART_INPUT_CLKPRSSEL_PRSCH3 << 8)  /**< Shifted mode PRSCH3 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH4            (_UART_INPUT_CLKPRSSEL_PRSCH4 << 8)  /**< Shifted mode PRSCH4 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH5            (_UART_INPUT_CLKPRSSEL_PRSCH5 << 8)  /**< Shifted mode PRSCH5 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH6            (_UART_INPUT_CLKPRSSEL_PRSCH6 << 8)  /**< Shifted mode PRSCH6 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH7            (_UART_INPUT_CLKPRSSEL_PRSCH7 << 8)  /**< Shifted mode PRSCH7 for UART_INPUT */
#define UART_INPUT_CLKPRS                      (0x1UL << 15)                        /**< PRS CLK Enable */
#define _UART_INPUT_CLKPRS_SHIFT               15                                   /**< Shift value for USART_CLKPRS */
#define _UART_INPUT_CLKPRS_MASK                0x8000UL                             /**< Bit mask for USART_CLKPRS */
#define _UART_INPUT_CLKPRS_DEFAULT             0x00000000UL                         /**< Mode DEFAULT for UART_INPUT */
#define UART_INPUT_CLKPRS_DEFAULT              (_UART_INPUT_CLKPRS_DEFAULT << 15)   /**< Shifted mode DEFAULT for UART_INPUT */

